tap "farion1231/ccswitch"
brew "asdf"
brew "openssl@3"
brew "bat"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-delta"
brew "hugo"
brew "xz"
brew "imagemagick"
brew "lazygit"
brew "libb2"
brew "make"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "nvm"
brew "pyenv"
brew "ripgrep"
brew "rustup"
brew "starship"
brew "tcl-tk@8"
brew "tldr"
brew "tmux"
brew "tree"
brew "unzip"
brew "uv"
brew "wget"
brew "yarn"
brew "zlib"
brew "zoxide"
cask "anaconda"
cask "basictex"
cask "farion1231/ccswitch/cc-switch"
cask "cursor"
cask "feishu"
cask "font-hack-nerd-font"
cask "font-maple-mono-nf-cn"
cask "ghostty"
cask "raycast"
cask "warp"
cask "windsurf"
cask "zoom"
cask "zotero"
vscode "adpyke.codesnap"
vscode "anthropic.claude-code"
vscode "formulahendry.code-runner"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "james-yu.latex-workshop"
vscode "lucien-martijn.parquet-visualizer"
vscode "mechatroner.rainbow-csv"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "sdras.night-owl"
vscode "shalldie.background"
vscode "tomoki1207.pdf"
vscode "zainchen.json"
